#### 📖 Terraform Plan ('infra-pe/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_service_attribute_authority.azurerm_private_dns_a_record.weu_pep["io-p-itn-cgn-pe-attribute-authority-app-01"] will be created
  + resource "azurerm_private_dns_a_record" "weu_pep" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-attribute-authority-app-01"
      + records             = [
          + "10.26.2.4",
        ]
      + resource_group_name = "cgnonboardingportal-p-vnet-rg"
      + ttl                 = 10
      + zone_name           = "privatelink.azurewebsites.net"
    }

  # module.app_service_attribute_authority.azurerm_private_dns_a_record.weu_pep["io-p-itn-cgn-pe-attribute-authority-app-01.scm"] will be created
  + resource "azurerm_private_dns_a_record" "weu_pep" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-attribute-authority-app-01.scm"
      + records             = [
          + "10.26.2.4",
        ]
      + resource_group_name = "cgnonboardingportal-p-vnet-rg"
      + ttl                 = 10
      + zone_name           = "privatelink.azurewebsites.net"
    }

  # module.app_service_onboarding_portal_backend.azurerm_private_dns_a_record.weu_pep["io-p-itn-cgn-pe-backend-app-01"] will be created
  + resource "azurerm_private_dns_a_record" "weu_pep" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-backend-app-01"
      + records             = [
          + "10.26.2.8",
        ]
      + resource_group_name = "cgnonboardingportal-p-vnet-rg"
      + ttl                 = 10
      + zone_name           = "privatelink.azurewebsites.net"
    }

  # module.app_service_onboarding_portal_backend.azurerm_private_dns_a_record.weu_pep["io-p-itn-cgn-pe-backend-app-01.scm"] will be created
  + resource "azurerm_private_dns_a_record" "weu_pep" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-backend-app-01.scm"
      + records             = [
          + "10.26.2.8",
        ]
      + resource_group_name = "cgnonboardingportal-p-vnet-rg"
      + ttl                 = 10
      + zone_name           = "privatelink.azurewebsites.net"
    }

  # module.networking.azurerm_virtual_network_peering.itn_weu will be created
  + resource "azurerm_virtual_network_peering" "itn_weu" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "io-p-itn-cgn-pe-vnet-01-to-cgnonboardingportal-p-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-vnet-rg/providers/Microsoft.Network/virtualNetworks/cgnonboardingportal-p-vnet"
      + resource_group_name                    = "io-p-itn-cgn-pe-rg-01"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "io-p-itn-cgn-pe-vnet-01"
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.data.azurerm_private_dns_zone.app_service will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "app_service" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.data.azurerm_virtual_network.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "io-p-itn-cgn-pe-vnet-01"
      + resource_group_name     = "io-p-itn-cgn-pe-rg-01"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_private_endpoint.app_service_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "app_service_sites" {
        id                       = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-app-pep-01"
        name                     = "io-p-itn-cgn-pe-backend-app-pep-01"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-app-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_private_endpoint.staging_app_service_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_app_service_sites" {
        id                       = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-staging-app-pep-01"
        name                     = "io-p-itn-cgn-pe-backend-staging-app-pep-01"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-staging-app-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
